// 5. Написать программу вычисления значения функции y = f(a)

Console.WriteLine("Please enter some number");
int a =int.Parse(Console.ReadLine());
double y = 3*a-5;
Console.WriteLine ($"Function is y=3*a-5, y={y}");
