// 0. Вывести квадрат числа
Console.WriteLine("Введите целое положительное число");
int a = Convert.ToInt32(Console.ReadLine());
int b = a*a;
Console.WriteLine(b);